tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Run your GitHub Actions locally 🚀
brew "act"
# Official Amazon AWS command-line interface
brew "awscli"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Emacs dependency management
brew "cask"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Top-like interface for container metrics
brew "ctop"
# Command-line fuzzy finder written in Go
brew "fzf"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Postgres C API library
brew "libpq"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple NodeJS versions
brew "nodenv"
# Simplistic interactive filtering tool
brew "peco"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Tool to build, change, and version infrastructure
brew "terraform"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# UNIX shell (command interpreter)
brew "zsh"
cask "adobe-creative-cloud"
cask "clipy"
cask "cyberduck"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "google-japanese-ime"
cask "insomnia"
cask "iterm2"
cask "karabiner-elements"
cask "kindle"
cask "ngrok"
cask "notion"
cask "slack"
cask "transmit"
cask "zoomus"
